# Задача 2. Манекенщицы
models = [
    {"Фамилия": "Зайцева", "Имя": "Лидия", "Отчество": "Павловна", "Пол": "женский", "Национальность": "русская", "Рост": 176, "Вес": 54, "Дата рождения": "2002-11-03", "Адрес": "000000, Россия, Примерская область, Центральный, Примерск, Учебная, 12, 8"},
    {"Фамилия": "Миронова", "Имя": "Ксения", "Отчество": "Олеговна", "Пол": "женский", "Национальность": "русская", "Рост": 181, "Вес": 56, "Дата рождения": "2004-06-17", "Адрес": "000000, Россия, Примерская область, Северный, Примерск, Тестовая, 7, 14"},
]

youngest = max(models, key=lambda model: model["Дата рождения"])
print("\n" + "=" * 45)
print("Самая молодая манекенщица:")
print("=" * 45)
for name, value in youngest.items():
    print(f"  {name}: {value}")
print("-" * 45)